Documents/ПроверкаЗнанияТребованийОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПроверкаЗнанияТребованийОхраныТруда</Name>
			<BasedOn>
				<xr:Item>Document.ОбучениеСотрудниковОхранеТруда</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПроверкиЗнанияТребованийОхраныТрудаСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыОбученияСотрудниковПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОбучения</Name>
					<Comment>Внутренняя/внешняя</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОбученияПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбучениеСотрудников</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбучениеСотрудниковОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУчебныхЧасов</Name>
					<Comment>АПК:58 различия имени и синонима оправданы. Длительность курса в часах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебноеЗаведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверкиЗнания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПротоколаПроверкиЗнания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РезультатыОбучения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обучение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОбучениеСотрудниковОхранеТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаОбучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияОбучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверкиЗнания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатыПроверкиЗнанияПоОхранеТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧленКомиссии</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольВКомиссии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РолиЧленовКомиссииОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОтстранениеОтРаботыПоРезультатамОбученияОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОтстранениеОтРаботыПоРезультатамОбученияОхранеТруда</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроверкаЗнанияТребованийОхраныТруда</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПроверкаЗнанияТребованийОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОтстранения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеРабочихМестСотрудникам</v8:Type>
						<v8:Type>cfg:DocumentRef.КадровыйПереводСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.УвольнениеСписком</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтсутствияССохранениемОплатыПриОбученииОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОтсутствияССохранениемОплатыПриОбученииОхранеТруда</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбучениеСотрудниковОхранеТруда</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроверкаЗнанияТребованийОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОтсутствия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОплатаПоСреднемуЗаработкуСписком</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ФормыОбученияПоОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ФормыОбученияПоОхранеТруда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Внутренняя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внешняя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РолиЧленовКомиссииОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РолиЧленовКомиссииОхраныТруда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Председатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧленКомиссии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаместительПредседателя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПроверкаЗнанияТребованийОхраныТруда/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(ФизическиеЛица.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОхранаТрудаКлиентСервер.ЗаполнитьПредставлениеДокумента(Данные, Представление, НСтр("ru = 'Проверка знания'"));
	
КонецПроцедуры
	
#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки, , "ОхранаТруда");
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ПроверкаЗнанияТребованийОхраныТруда;
	ОписаниеСостава = ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	ОхранаТруда.НеВключатьЧленовКомиссииВКраткийСоставДокумента(МетаданныеДокумента.ТабличныеЧасти.Комиссия.Имя, ОписаниеСостава);
	
	Возврат ОписаниеСостава;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Протокол проверки знания требований охраны труда
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.ПроверкаЗнанияТребованийОхраныТруда";
	КомандаПечати.Идентификатор = "ПФ_MXL_ПротоколПроверкиЗнанияТребованийОхраныТруда";
	КомандаПечати.ФункциональныеОпции = "ИспользоватьОбучениеПоОхранеТруда";
	КомандаПечати.Представление = НСтр("ru = 'Протокол проверки знания требований охраны труда'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ОшибкиПечати          - Список значений  - Ошибки печати  (значение - ссылка на объект, представление - текст
//                           ошибки).
//   ОбъектыПечати         - Список значений  - Объекты печати (значение - ссылка на объект, представление - имя
//                           области в которой был выведен объект).
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПротоколПроверкиЗнанияТребованийОхраныТруда") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_ПротоколПроверкиЗнанияТребованийОхраныТруда",
			НСтр("ru = 'Протокол проверки знания требований охраны труда'"),
			ПечатьПротоколаПроверкиЗнанияТребованийОхраныТруда(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьПротоколаПроверкиЗнанияТребованийОхраныТруда(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПротоколПроверкиЗнанияТребованийОхраныТруда";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы(
		"Документ.ПроверкаЗнанияТребованийОхраныТруда.ПФ_MXL_ПротоколПроверкиЗнанияТребованийОхраныТруда");
	
	ДанныеДляПечати = ДанныеПечатиДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	Для Каждого ДанныеПечати Из ДанныеДляПечати Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
		КонецЕсли;
		
		ОписаниеДокумента = ДанныеПечати.Значение;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		// Формируем печатную форму протокола.
		Результат = Новый ТабличныйДокумент;
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.Заполнить(ОписаниеДокумента);
		Результат.Вывести(ОбластьШапка);
		
		ЕстьПредседательКомиссии = ОписаниеДокумента.Свойство("ПредседательКомиссии");
		Если ЕстьПредседательКомиссии Тогда
			ОбластьПредседатель = Макет.ПолучитьОбласть("Председатель");
			ОбластьПредседатель.Параметры.Заполнить(ОписаниеДокумента);
			Результат.Вывести(ОбластьПредседатель);
		КонецЕсли;
		
		ЕстьЗаместительПредседателяКомиссии = ОписаниеДокумента.Свойство("ЗаместительПредседателяКомиссии");
		Если ЕстьЗаместительПредседателяКомиссии Тогда
			ОбластьЗаместительПредседателя = Макет.ПолучитьОбласть("ЗаместительПредседателя");
			ОбластьЗаместительПредседателя.Параметры.Заполнить(ОписаниеДокумента);
			Результат.Вывести(ОбластьЗаместительПредседателя);
		КонецЕсли;
		
		ПервыйПроход = Истина;
		Для Каждого ДанныеЧленаКомиссии Из ОписаниеДокумента.ЧленыКомиссии Цикл
			ОбластьЧленКомиссии = Макет.ПолучитьОбласть(?(ПервыйПроход, "ПервыйЧленКомиссии", "ЧленКомиссии"));
			ОбластьЧленКомиссии.Параметры.Заполнить(ДанныеЧленаКомиссии);
			Результат.Вывести(ОбластьЧленКомиссии);
			ПервыйПроход = Ложь;
		КонецЦикла;
		
		ОбластьПрограмма = Макет.ПолучитьОбласть("Программа");
		ОбластьПрограмма.Параметры.Заполнить(ОписаниеДокумента);
		Результат.Вывести(ОбластьПрограмма);
		
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		Результат.Вывести(ОбластьШапкаТаблицы);
		
		ТаблицаОбученных = ОписаниеДокумента.ТаблицаОбученных;
		Для Каждого СтрокаОбученный Из ТаблицаОбученных Цикл
			ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
			ОбластьСтрокаТаблицы.Параметры.Заполнить(СтрокаОбученный);
			ОбластьСтрокаТаблицы.Параметры.МестоРаботы =
				СтрШаблон(НСтр("ru = '%1, %2'"), СтрокаОбученный.Организация, СтрокаОбученный.Подразделение);
			Результат.Вывести(ОбластьСтрокаТаблицы);
		КонецЦикла;
		
		Если ОписаниеДокумента.ФормаОбучения = Перечисления.ФормыОбученияПоОхранеТруда.Внутренняя Тогда
			ОбластьПодвалПустаяСтрока = Макет.ПолучитьОбласть("ПодвалПустаяСтрока");
			Результат.Вывести(ОбластьПодвалПустаяСтрока);
			
			Если ЕстьПредседательКомиссии Тогда
				ОбластьПодписьПредседателяКомиссии = Макет.ПолучитьОбласть("ПодписьПредседателяКомиссии");
				ОбластьПодписьПредседателяКомиссии.Параметры.Заполнить(ОписаниеДокумента);
				Результат.Вывести(ОбластьПодписьПредседателяКомиссии);
			КонецЕсли;
			
			Если ЕстьЗаместительПредседателяКомиссии Тогда
				ОбластьПодписьЗаместителяПредседателяКомиссии = Макет.ПолучитьОбласть("ПодписьЗаместителяПредседателяКомиссии");
				ОбластьПодписьЗаместителяПредседателяКомиссии.Параметры.Заполнить(ОписаниеДокумента);
				Результат.Вывести(ОбластьПодписьЗаместителяПредседателяКомиссии);
			КонецЕсли;
			
			ОбластьЗаголовокПодписейЧленовКомиссии = Макет.ПолучитьОбласть("ЗаголовокПодписейЧленовКомиссии");
			Результат.Вывести(ОбластьЗаголовокПодписейЧленовКомиссии);
			
			ОбластьПодписьЧленаКомиссии = Макет.ПолучитьОбласть("ПодписьЧленаКомиссии");
			Для Каждого ДанныеЧленаКомиссии Из ОписаниеДокумента.ЧленыКомиссии Цикл
				ОбластьПодписьЧленаКомиссии.Параметры.Заполнить(ДанныеЧленаКомиссии);
				Результат.Вывести(ОбластьПодписьЧленаКомиссии);
			КонецЦикла;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Результат);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ОписаниеДокумента.ДокументСсылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ДанныеПечатиДокументов(МассивОбъектов)
	
	ДанныеПечатиОбъектов = Новый Соответствие;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПроверкаЗнанияТребованийОхраныТруда.Ссылка КАК ДокументСсылка,
		|	ПроверкаЗнанияТребованийОхраныТруда.Номер КАК Номер,
		|	ПроверкаЗнанияТребованийОхраныТруда.Дата КАК Дата,
		|	ПроверкаЗнанияТребованийОхраныТруда.ДатаПроверкиЗнания КАК Период,
		|	ПроверкаЗнанияТребованийОхраныТруда.ДатаПроверкиЗнания КАК ДатаПроверкиЗнания,
		|	ПроверкаЗнанияТребованийОхраныТруда.НомерПротоколаПроверкиЗнания КАК НомерПротоколаПроверкиЗнания,
		|	ПроверкаЗнанияТребованийОхраныТруда.Подразделение КАК Подразделение,
		|	ПроверкаЗнанияТребованийОхраныТруда.КоличествоУчебныхЧасов КАК КоличествоУчебныхЧасов,
		|	ПроверкаЗнанияТребованийОхраныТруда.ПрограммаОбучения.ПрограммаОбученияМинтруда КАК Программа,
		|	ПроверкаЗнанияТребованийОхраныТруда.ПрограммаОбучения.ФормаОбучения КАК ФормаОбучения,
		|	ПроверкаЗнанияТребованийОхраныТруда.КоличествоУчебныхЧасов КАК КоличествоЧасов,
		|	ВЫРАЗИТЬ(Организации.НаименованиеСокращенное КАК СТРОКА(1000)) Организация,
		|	ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(1000)) КАК ОрганизацияНаименованиеПолное,
		|	ПроверкаЗнанияТребованийОхраныТрудаРезультатыОбучения.НомерСтроки КАК НомерСтроки,
		|	ПроверкаЗнанияТребованийОхраныТрудаРезультатыОбучения.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПроверкаЗнанияТребованийОхраныТрудаРезультатыОбучения.РабочееМесто.Должность КАК Должность,
		|	ПроверкаЗнанияТребованийОхраныТрудаРезультатыОбучения.РабочееМесто.Подразделение КАК ПодразделениеСотрудника,
		|	ПроверкаЗнанияТребованийОхраныТрудаРезультатыОбучения.РезультатПроверкиЗнания КАК РезультатПроверкиЗнания
		|ПОМЕСТИТЬ ВТСотрудникиДокументов
		|ИЗ
		|	Документ.ПроверкаЗнанияТребованийОхраныТруда.РезультатыОбучения КАК
		|		ПроверкаЗнанияТребованийОхраныТрудаРезультатыОбучения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроверкаЗнанияТребованийОхраныТруда КАК ПроверкаЗнанияТребованийОхраныТруда
		|		ПО ПроверкаЗнанияТребованийОхраныТрудаРезультатыОбучения.Ссылка В (&МассивОбъектов)
		|		И ПроверкаЗнанияТребованийОхраныТрудаРезультатыОбучения.Ссылка = ПроверкаЗнанияТребованийОхраныТруда.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ПроверкаЗнанияТребованийОхраныТруда.Организация = Организации.Ссылка";
	
	Запрос.Выполнить();
	
	ОписательВТ = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(
		Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиДокументов");
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВТ, Истина, "ФИОПолные");
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроверкаЗнанияТребованийОхраныТруда.Ссылка КАК ДокументСсылка,
		|	ПроверкаЗнанияТребованийОхраныТрудаКомиссия.ЧленКомиссии КАК ЧленКомиссии,
		|	ПроверкаЗнанияТребованийОхраныТрудаКомиссия.Должность КАК ДолжностьЧленаКомиссии,
		|	ПроверкаЗнанияТребованийОхраныТрудаКомиссия.РольВКомиссии КАК РольВКомиссии
		|ИЗ
		|	Документ.ПроверкаЗнанияТребованийОхраныТруда КАК ПроверкаЗнанияТребованийОхраныТруда
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроверкаЗнанияТребованийОхраныТруда.Комиссия КАК
		|			ПроверкаЗнанияТребованийОхраныТрудаКомиссия
		|		ПО ПроверкаЗнанияТребованийОхраныТруда.Ссылка = ПроверкаЗнанияТребованийОхраныТрудаКомиссия.Ссылка
		|ГДЕ
		|	ПроверкаЗнанияТребованийОхраныТруда.Ссылка В (&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПроверкаЗнанияТребованийОхраныТруда.ДокументСсылка,
		|	ПроверкаЗнанияТребованийОхраныТруда.Номер,
		|	ПроверкаЗнанияТребованийОхраныТруда.Дата,
		|	ПроверкаЗнанияТребованийОхраныТруда.ДатаПроверкиЗнания,
		|	ПроверкаЗнанияТребованийОхраныТруда.НомерПротоколаПроверкиЗнания,
		|	ПроверкаЗнанияТребованийОхраныТруда.Программа,
		|	ПроверкаЗнанияТребованийОхраныТруда.ФормаОбучения,
		|	ПроверкаЗнанияТребованийОхраныТруда.КоличествоУчебныхЧасов КАК КоличествоЧасов,
		|	ПроверкаЗнанияТребованийОхраныТруда.Организация,
		|	ПроверкаЗнанияТребованийОхраныТруда.Подразделение,
		|	ПроверкаЗнанияТребованийОхраныТруда.ОрганизацияНаименованиеПолное КАК ОрганизацияНаименованиеПолное
		|ИЗ
		|	ВТСотрудникиДокументов КАК ПроверкаЗнанияТребованийОхраныТруда
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроверкаЗнанияТребованийОхраныТруда.ДокументСсылка КАК ДокументСсылка,
		|	ПроверкаЗнанияТребованийОхраныТруда.Организация КАК Организация,
		|	ПроверкаЗнанияТребованийОхраныТруда.НомерСтроки КАК НомерПоПорядку,
		|	ПроверкаЗнанияТребованийОхраныТруда.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПроверкаЗнанияТребованийОхраныТруда.РезультатПроверкиЗнания КАК РезультатПроверкиЗнания,
		|	ПроверкаЗнанияТребованийОхраныТруда.Должность КАК Должность,
		|	ПроверкаЗнанияТребованийОхраныТруда.ПодразделениеСотрудника КАК Подразделение,
		|	ЕСТЬNULL(КадровыеДанныеФизическихЛиц.ФИОПолные, ПроверкаЗнанияТребованийОхраныТруда.ФизическоеЛицо) КАК ФИОСотрудника
		|ИЗ
		|	ВТСотрудникиДокументов КАК ПроверкаЗнанияТребованийОхраныТруда
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизическихЛиц
		|		ПО ПроверкаЗнанияТребованийОхраныТруда.ФизическоеЛицо = КадровыеДанныеФизическихЛиц.ФизическоеЛицо
		|		И ПроверкаЗнанияТребованийОхраныТруда.ДатаПроверкиЗнания = КадровыеДанныеФизическихЛиц.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументСсылка,
		|	НомерПоПорядку";
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	МаксимальныйИндекс = РезультатыЗапроса.ВГраница();
	
	ВыборкаОбученных = РезультатыЗапроса[МаксимальныйИндекс].Выбрать();
	ВыборкаДокументов = РезультатыЗапроса[МаксимальныйИндекс - 1].Выбрать();
	ВыборкаКомиссия = РезультатыЗапроса[МаксимальныйИндекс - 2].Выбрать();
	Пока ВыборкаДокументов.Следующий() Цикл
		Описание = ОписаниеДляПечати();
		ЗаполнитьОписаниеОбученными(Описание, ВыборкаДокументов, ВыборкаОбученных);
		ЗаполнитьОписаниеЧленамиКомиссии(Описание, ВыборкаДокументов, ВыборкаКомиссия);
		
		// Заполнение соответствия
		ДанныеПечатиОбъектов.Вставить(ВыборкаДокументов.ДокументСсылка, Описание);
	КонецЦикла;
	
	Возврат ДанныеПечатиОбъектов;
	
КонецФункции

Функция ОписаниеДляПечати()
	
	Описание = Новый Структура;
	Описание.Вставить("ДокументСсылка");
	Описание.Вставить("Дата");
	Описание.Вставить("Номер");
	Описание.Вставить("ДатаПроверкиЗнания");
	Описание.Вставить("НомерПротоколаПроверкиЗнания");
	Описание.Вставить("ОрганизацияНаименованиеПолное");
	Описание.Вставить("ПодразделениеПредставление");
	Описание.Вставить("Программа");
	Описание.Вставить("ФормаОбучения");
	Описание.Вставить("КоличествоЧасов");
	Описание.Вставить("ТаблицаОбученных");
	
	ТаблицаОбученных = Новый ТаблицаЗначений;
	ТаблицаОбученных.Колонки.Добавить("ДокументСсылка", Новый ОписаниеТипов("ДокументСсылка.ПроверкаЗнанияТребованийОхраныТруда"));
	ТаблицаОбученных.Колонки.Добавить("НомерПоПорядку", Новый ОписаниеТипов("Число"));
	ТаблицаОбученных.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаОбученных.Колонки.Добавить("РезультатПроверкиЗнания", Новый ОписаниеТипов("ПеречислениеСсылка.РезультатыПроверкиЗнанияПоОхранеТруда"));
	ТаблицаОбученных.Колонки.Добавить("ФИОСотрудника", Новый ОписаниеТипов("Строка"));
	ТаблицаОбученных.Колонки.Добавить("Должность", Новый ОписаниеТипов("СправочникСсылка.Должности"));
	ТаблицаОбученных.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТаблицаОбученных.Колонки.Добавить("Организация", Новый ОписаниеТипов("Строка"));
	
	Описание.ТаблицаОбученных = ТаблицаОбученных;
	
	Возврат Описание;
	
КонецФункции

Процедура ЗаполнитьОписаниеОбученными(Описание, ВыборкаДокументов, ВыборкаОбученных)
	
	ЗаполнитьЗначенияСвойств(Описание, ВыборкаДокументов);
	
	Описание.Дата = Формат(ВыборкаДокументов.Дата, "ДЛФ=D");
	Описание.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаДокументов.Номер);
	Описание.ДатаПроверкиЗнания = Формат(ВыборкаДокументов.ДатаПроверкиЗнания, "ДЛФ=ДД");
	Если Не ЗначениеЗаполнено(Описание.НомерПротоколаПроверкиЗнания) Тогда
		Описание.НомерПротоколаПроверкиЗнания = Описание.Номер;
	КонецЕсли;
	
	Описание.ПодразделениеПредставление = Строка(ВыборкаДокументов.Подразделение);
	
	Пока ВыборкаОбученных.НайтиСледующий(ВыборкаДокументов.ДокументСсылка, "ДокументСсылка") Цикл
		ЗаполнитьЗначенияСвойств(Описание.ТаблицаОбученных.Добавить(), ВыборкаОбученных);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОписаниеЧленамиКомиссии(Описание, ВыборкаДокументов, ВыборкаКомиссия)
	
	МассивЧленовКомиссии = Новый Массив;
	Пока ВыборкаКомиссия.НайтиСледующий(ВыборкаДокументов.ДокументСсылка, "ДокументСсылка") Цикл
		Если ВыборкаКомиссия.РольВКомиссии = Перечисления.РолиЧленовКомиссииОхраныТруда.Председатель Тогда
			Описание.Вставить("ПредседательКомиссии", ВыборкаКомиссия.ЧленКомиссии);
			// ФИОПредседателяКомиссии
			Описание.Вставить("ФИОПредседателяКомиссии", "");
			КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(
				Истина, ВыборкаКомиссия.ЧленКомиссии, "ФамилияИО", ОбщегоНазначения.ТекущаяДатаПользователя());
			Для каждого СтрокаКадровыхДанных Из КадровыеДанные Цикл
				Описание.Вставить("ФИОПредседателяКомиссии", СтрокаКадровыхДанных.ФамилияИО);
			КонецЦикла;
			Описание.Вставить("ДолжностьПредседателяКомиссии", ВыборкаКомиссия.ДолжностьЧленаКомиссии);
		ИначеЕсли ВыборкаКомиссия.РольВКомиссии = Перечисления.РолиЧленовКомиссииОхраныТруда.ЗаместительПредседателя Тогда
			Описание.Вставить("ЗаместительПредседателяКомиссии", ВыборкаКомиссия.ЧленКомиссии);
			// ФИОЗаместителяПредседателяКомиссии
			Описание.Вставить("ФИОЗаместителяПредседателяКомиссии", "");
			КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(
				Истина, ВыборкаКомиссия.ЧленКомиссии, "ФамилияИО", ОбщегоНазначения.ТекущаяДатаПользователя());
			Для каждого СтрокаКадровыхДанных Из КадровыеДанные Цикл
				Описание.Вставить("ФИОЗаместителяПредседателяКомиссии", СтрокаКадровыхДанных.ФамилияИО);
			КонецЦикла;
			Описание.Вставить("ДолжностьЗаместителяПредседателяКомиссии", ВыборкаКомиссия.ДолжностьЧленаКомиссии);
		Иначе
			КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(
				Истина, ВыборкаКомиссия.ЧленКомиссии, "ФамилияИО", ОбщегоНазначения.ТекущаяДатаПользователя());
			Для каждого СтрокаКадровыхДанных Из КадровыеДанные Цикл
				МассивЧленовКомиссии.Добавить(Новый Структура("ЧленКомиссии, ФИОЧленКомиссии, ДолжностьЧленаКомиссии",
					ВыборкаКомиссия.ЧленКомиссии, СтрокаКадровыхДанных.ФамилияИО, ВыборкаКомиссия.ДолжностьЧленаКомиссии));
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Описание.Вставить("ЧленыКомиссии", МассивЧленовКомиссии);
	
КонецПроцедуры

#КонецОбласти

Функция ПолучитьДанныеДляПроведения(Ссылка)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроверкаЗнанияТребованийОхраныТруда.Организация КАК Организация,
		|	ПроверкаЗнанияТребованийОхраныТруда.ДатаПроверкиЗнания КАК Период,
		|	ПроверкаЗнанияТребованийОхраныТруда.НомерПротоколаПроверкиЗнания КАК НомерПротокола,
		|	ПроверкаЗнанияТребованийОхраныТрудаРезультатыОбучения.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПроверкаЗнанияТребованийОхраныТрудаРезультатыОбучения.РабочееМесто КАК РабочееМесто,
		|	ПроверкаЗнанияТребованийОхраныТрудаРезультатыОбучения.РезультатПроверкиЗнания КАК РезультатПроверки,
		|	ПрограммыОбученияСотрудниковПоОхранеТруда.Ссылка КАК ПрограммаОбучения,
		|	ПрограммыОбученияСотрудниковПоОхранеТруда.ПрограммаОбученияМинтруда КАК ПрограммаОбученияМинтруда
		|ПОМЕСТИТЬ ВТОбучениеПоОхранеТруда
		|ИЗ
		|	Документ.ПроверкаЗнанияТребованийОхраныТруда.РезультатыОбучения КАК
		|		ПроверкаЗнанияТребованийОхраныТрудаРезультатыОбучения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроверкаЗнанияТребованийОхраныТруда КАК ПроверкаЗнанияТребованийОхраныТруда
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПрограммыОбученияСотрудниковПоОхранеТруда КАК ПрограммыОбученияСотрудниковПоОхранеТруда
		|			ПО ПроверкаЗнанияТребованийОхраныТруда.ПрограммаОбучения = ПрограммыОбученияСотрудниковПоОхранеТруда.Ссылка
		|		ПО ПроверкаЗнанияТребованийОхраныТруда.Ссылка = &Ссылка
		|		И ПроверкаЗнанияТребованийОхраныТрудаРезультатыОбучения.Ссылка = ПроверкаЗнанияТребованийОхраныТруда.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ДанныеДляПроведения = Новый Структура;
	ДанныеДляПроведения.Вставить("ОбучениеПоОхранеТруда", Запрос.Выполнить().Выгрузить());
	
	Возврат ДанныеДляПроведения;

КонецФункции

// Возвращает данные проверки знания требований охраны труда.
//
// Параметры:
//   ДокументСсылка - ДокументСсылка.ПроверкаЗнанияТребованийОхраныТруда - 
//
// Возвращаемое значение:
//   ТаблицаЗначений:
//    * Ссылка - ДокументСсылка.ПроверкаЗнанияТребованийОхраныТруда
//    * Номер - Строка
//    * Дата - Дата
//    * Проведен - Булево
//    * Организация - СправочникСсылка.Организации
//    * Обучение - ДокументСсылка.ОбучениеСотрудниковОхранеТруда
//    * ДатаПроверкиЗнания - Дата
//    * ПрограммаОбучения - СправочникСсылка.ПрограммыОбученияСотрудниковПоОхранеТруда
//    * ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//    * РабочееМесто - СправочникСсылка.РабочиеМестаОхраныТруда
//    * РезультатПроверкиЗнания - ПеречислениеСсылка.РезультатыПроверкиЗнанияПоОхранеТруда
//    * Ответственный - СправочникСсылка.Пользователи
//    * Комментарий - Строка
//    * ДокументОтстранения - ДокументСсылка.КадровыйПереводСписком, ДокументСсылка.УвольнениеСписком - 
//
Функция ДанныеПроверки(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проверка.Ссылка КАК Ссылка,
		|	Проверка.Номер КАК Номер,
		|	Проверка.Дата КАК Дата,
		|	Проверка.Проведен КАК Проведен,
		|	Проверка.Организация КАК Организация,
		|	Проверка.ДатаПроверкиЗнания КАК ДатаПроверкиЗнания,
		|	Проверка.ПрограммаОбучения КАК ПрограммаОбучения,
		|	ПроверкаРезультатыОбучения.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПроверкаРезультатыОбучения.РабочееМесто КАК РабочееМесто,
		|	ПроверкаРезультатыОбучения.Обучение КАК Обучение,
		|	ПроверкаРезультатыОбучения.РезультатПроверкиЗнания КАК РезультатПроверкиЗнания,
		|	Проверка.Ответственный КАК Ответственный,
		|	Проверка.Комментарий КАК Комментарий,
		|	ОтстранениеОтРаботы.ДокументОтстранения КАК ДокументОтстранения,
		|	Отсутствия.ДокументОтсутствия КАК ДокументОтсутствия
		|ИЗ
		|	Документ.ПроверкаЗнанияТребованийОхраныТруда КАК Проверка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроверкаЗнанияТребованийОхраныТруда.РезультатыОбучения КАК ПроверкаРезультатыОбучения
		|		ПО Проверка.Ссылка = ПроверкаРезультатыОбучения.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтстранениеОтРаботыПоРезультатамОбученияОхранеТруда КАК ОтстранениеОтРаботы
		|		ПО ОтстранениеОтРаботы.ПроверкаЗнанияТребованийОхраныТруда = ПроверкаРезультатыОбучения.Ссылка
		|		И ОтстранениеОтРаботы.ФизическоеЛицо = ПроверкаРезультатыОбучения.ФизическоеЛицо
		|		И ОтстранениеОтРаботы.ДокументОтстранения.Проведен
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтсутствияССохранениемОплатыПриОбученииОхранеТруда КАК Отсутствия
		|		ПО Отсутствия.ДокументОснование = ПроверкаРезультатыОбучения.Ссылка
		|		И Отсутствия.ФизическоеЛицо = ПроверкаРезультатыОбучения.ФизическоеЛицо
		|		И Отсутствия.ДокументОснование.Проведен
		|ГДЕ
		|	Проверка.Ссылка = &Ссылка";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
